In [1]:
import pandas as pd

In [18]:
order = pd.read_table("http://bit.ly/chiporders")

C:\Users\rohit-ga\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

In [3]:
order.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

#### Above data happened to be formatted perfectly that it would work well with the default parameter of read_table.
#### This will not hold true for every data

In [4]:
df = pd.read_table("http://bit.ly/movieusers")

C:\Users\rohit-ga\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

In [5]:
df.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

#### Here the data is | seperated. Therefore we need to communicate this to pandas by giving sep parameter

In [6]:
df1 = pd.read_table("http://bit.ly/movieusers", sep='|')

C:\Users\rohit-ga\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [7]:
df1.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

#### We can see that it takes the first row as a header row.

In [10]:
df1 = pd.read_table("http://bit.ly/movieusers", sep='|',header=None)

C:\Users\rohit-ga\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [12]:
df1.head()

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

#### We can give the column some names

In [16]:
cols = ['ID','Age','Gender','Occupation','Code']
df1= pd.read_table("http://bit.ly/movieusers", sep='|',header=None , names= cols)

C:\Users\rohit-ga\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead.

In [17]:
df1.head()

   ID  Age Gender  Occupation   Code
0   1   24      M  technician  85711
1   2   53      F       other  94043
2   3   23      M      writer  32067
3   4   24      M  technician  43537
4   5   33      F       other  15213